Masmiseim36/nxpSDK/boards/twrkv11z75m/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC1 (number 44), J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0
  @{ */
#define PINTOOL_FTM_LED_GREEN1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN1_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                          /* @} */

/*! @name PORTC2 (number 45), J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1
  @{ */
#define PINTOOL_FTM_LED_YELLOW1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW1_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                           /* @} */

/*! @name PORTC3 (number 46), J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2
  @{ */
#define PINTOOL_FTM_LED_GREEN2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN2_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                          /* @} */

/*! @name PORTC4 (number 49), J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3
  @{ */
#define PINTOOL_FTM_LED_YELLOW2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW2_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                           /* @} */

/*! @name PORTD4 (number 61), J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4
  @{ */
#define PINTOOL_FTM_LED_GREEN3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_GREEN3_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                          /* @} */

/*! @name PORTD5 (number 62), J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5
  @{ */
#define PINTOOL_FTM_LED_YELLOW3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_YELLOW3_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 Transmit Data Source Select: UART0_TX pin */

/*! @name PORTB16 (number 39), J24[9]/J500[7]/J506[2]/U512[2]/RXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                              /* @} */

/*! @name PORTB17 (number 40), J24[10]/J500[5]/J505[2]/U513[4]/TXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

#define SOPT4_FTM0FLT1_FTM 0x00u /*!<@brief FTM0 Fault 1 Select: FTM0_FLT1 pin */

/*! @name PORTA13 (number 29), J5[3]/U4[8]
  @{ */
#define PINTOOL_MISC_BREAKING_RESISTOR_FGPIO FGPIOA /*!<@brief FGPIO device name: FGPIOA */
#define PINTOOL_MISC_BREAKING_RESISTOR_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_BREAKING_RESISTOR_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_BREAKING_RESISTOR_PIN 13U    /*!<@brief PORTA pin index: 13 */
                                                  /* @} */

/*! @name PORTA4 (number 26), J24[7]/J500[14]/SW2
  @{ */
#define PINTOOL_MISC_SW2_FGPIO FGPIOA /*!<@brief FGPIO device name: FGPIOA */
#define PINTOOL_MISC_SW2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW2_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                    /* @} */

/*! @name PORTA5 (number 27), J22[B21]
  @{ */
#define PINTOOL_MISC_USER_LED_FGPIO FGPIOA /*!<@brief FGPIO device name: FGPIOA */
#define PINTOOL_MISC_USER_LED_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_USER_LED_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_USER_LED_PIN 5U     /*!<@brief PORTA pin index: 5 */
                                         /* @} */

/*! @name PORTE29 (number 17), J18[12]/J22[B52]/J22[D52]/CMP0_IN5
  @{ */
#define PINTOOL_MISC_SPI_PREDRIVER_FGPIO FGPIOE /*!<@brief FGPIO device name: FGPIOE */
#define PINTOOL_MISC_SPI_PREDRIVER_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_SPI_PREDRIVER_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_SPI_PREDRIVER_PIN 29U    /*!<@brief PORTE pin index: 29 */
                                              /* @} */

/*! @name PORTB2 (number 37), J6[4]/J18[19]/J22[B62]/J24[11]/J500[37]/FTM0_FLT1/THM3N
  @{ */
#define PINTOOL_MISC_THM3N_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_THM3N_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
